[
    {
        "role": "Software Engineer",
        "domain": "tech",
        "text": "Hiring a Software Engineer to build backend systems, contribute to code reviews, and ensure reliable deployments across cloud environments."
    },
    {
        "role": "Software Engineer",
        "domain": "tech",
        "text": "Seeking a Software Engineer with experience in Python and microservices to help maintain scalable production services."
    },
    {
        "role": "Software Engineer",
        "domain": "tech",
        "text": "Looking for a Software Engineer to design APIs, implement features, and support testing workflows."
    },
    {
        "role": "Software Engineer",
        "domain": "tech",
        "text": "Software Engineer needed to develop services, optimize performance, and collaborate with engineering teams."
    },
    {
        "role": "Software Engineer",
        "domain": "tech",
        "text": "Join our engineering team as a Software Engineer focusing on distributed systems, automation, and quality assurance."
    },
    {
        "role": "Data Scientist",
        "domain": "tech",
        "text": "Seeking a Data Scientist to analyze datasets, build predictive models, and support data-driven decision-making."
    },
    {
        "role": "Data Scientist",
        "domain": "tech",
        "text": "Hiring a Data Scientist with experience in Python and machine learning to develop analytical solutions."
    },
    {
        "role": "Data Scientist",
        "domain": "tech",
        "text": "Data Scientist role involving model training, evaluation, and experimental documentation."
    },
    {
        "role": "Data Scientist",
        "domain": "tech",
        "text": "Looking for a Data Scientist to work on feature engineering, model testing, and performance reporting."
    },
    {
        "role": "Data Scientist",
        "domain": "tech",
        "text": "Seeking a Data Scientist who can interpret data insights, prototype ML workflows, and support analytics pipelines."
    },
    {
        "role": "Product Manager",
        "domain": "tech",
        "text": "Hiring a Product Manager to define requirements, guide releases, and collaborate with engineering and design teams."
    },
    {
        "role": "Product Manager",
        "domain": "tech",
        "text": "Seeking a Product Manager to manage roadmaps, coordinate team priorities, and ensure product alignment with goals."
    },
    {
        "role": "Product Manager",
        "domain": "tech",
        "text": "Product Manager needed to support feature planning, stakeholder communication, and product analysis."
    },
    {
        "role": "Product Manager",
        "domain": "tech",
        "text": "Looking for a Product Manager to assist with backlog refinement, cross-team communication, and release readiness."
    },
    {
        "role": "Product Manager",
        "domain": "tech",
        "text": "Join our team as a Product Manager focusing on market understanding, planning, and execution support."
    },
    {
        "role": "Project Manager",
        "domain": "business",
        "text": "Seeking a Project Manager to coordinate timelines, manage tasks, and support efficient project execution."
    },
    {
        "role": "Project Manager",
        "domain": "business",
        "text": "Hiring a Project Manager to oversee workflows, track progress, and manage cross-functional collaboration."
    },
    {
        "role": "Project Manager",
        "domain": "business",
        "text": "Project Manager needed to maintain schedules, handle documentation, and ensure project alignment."
    },
    {
        "role": "Project Manager",
        "domain": "business",
        "text": "Looking for a Project Manager to support planning, resource tracking, and reporting."
    },
    {
        "role": "Project Manager",
        "domain": "business",
        "text": "Project Manager role focusing on coordination, communication, and risk monitoring."
    },
    {
        "role": "Financial Analyst",
        "domain": "business",
        "text": "Hiring a Financial Analyst to assist with budgeting, forecasting, and data reporting."
    },
    {
        "role": "Financial Analyst",
        "domain": "business",
        "text": "Seeking a Financial Analyst to evaluate financial metrics and support analysis tasks."
    },
    {
        "role": "Financial Analyst",
        "domain": "business",
        "text": "Financial Analyst needed to prepare reports, review data accuracy, and support planning processes."
    },
    {
        "role": "Financial Analyst",
        "domain": "business",
        "text": "Looking for a Financial Analyst with strong numerical skills to analyze datasets and produce summaries."
    },
    {
        "role": "Financial Analyst",
        "domain": "business",
        "text": "Join our finance team as a Financial Analyst focused on modeling and financial monitoring."
    },
    {
        "role": "Marketing Manager",
        "domain": "business",
        "text": "Seeking a Marketing Manager to support campaign planning, performance tracking, and communication tasks."
    },
    {
        "role": "Marketing Manager",
        "domain": "business",
        "text": "Hiring a Marketing Manager to coordinate marketing activities, analyze results, and maintain documentation."
    },
    {
        "role": "Marketing Manager",
        "domain": "business",
        "text": "Marketing Manager needed to work on content planning, market insights, and performance reviews."
    },
    {
        "role": "Marketing Manager",
        "domain": "business",
        "text": "Looking for a Marketing Manager to help manage campaigns, review metrics, and support brand tasks."
    },
    {
        "role": "Marketing Manager",
        "domain": "business",
        "text": "Join our team as a Marketing Manager focusing on analytics, coordination, and planning."
    },
    {
        "role": "Registered Nurse (ICU)",
        "domain": "health",
        "text": "Seeking an ICU Registered Nurse to monitor patients, manage treatments, and follow clinical protocols."
    },
    {
        "role": "Registered Nurse (ICU)",
        "domain": "health",
        "text": "ICU Nurse needed for patient monitoring, medication support, and documentation duties."
    },
    {
        "role": "Registered Nurse (ICU)",
        "domain": "health",
        "text": "Hiring an ICU Nurse to provide clinical care, maintain safety standards, and assist medical teams."
    },
    {
        "role": "Registered Nurse (ICU)",
        "domain": "health",
        "text": "Registered Nurse (ICU) role involving treatment management and patient observation."
    },
    {
        "role": "Registered Nurse (ICU)",
        "domain": "health",
        "text": "Hiring a Registered Nurse (ICU) to support critical-care procedures and maintain accurate records."
    },
    {
        "role": "Pediatric Nurse",
        "domain": "health",
        "text": "Seeking a Pediatric Nurse to assist with patient assessments, treatments, and care documentation."
    },
    {
        "role": "Pediatric Nurse",
        "domain": "health",
        "text": "Hiring a Pediatric Nurse to support clinical tasks, monitor progress, and ensure care accuracy."
    },
    {
        "role": "Pediatric Nurse",
        "domain": "health",
        "text": "Pediatric Nurse needed for treatment administration, record-keeping, and patient support."
    },
    {
        "role": "Pediatric Nurse",
        "domain": "health",
        "text": "Looking for a Pediatric Nurse to help with care routines, safety protocols, and coordination."
    },
    {
        "role": "Pediatric Nurse",
        "domain": "health",
        "text": "Join our team as a Pediatric Nurse focusing on treatment monitoring and care processes."
    },
    {
        "role": "Pharmacist",
        "domain": "health",
        "text": "Hiring a Pharmacist to dispense prescriptions, manage inventory, and support medication safety."
    },
    {
        "role": "Pharmacist",
        "domain": "health",
        "text": "Seeking a Pharmacist to verify dosages, review interactions, and maintain documentation."
    },
    {
        "role": "Pharmacist",
        "domain": "health",
        "text": "Pharmacist needed to assist with medication handling, record keeping, and regulatory compliance."
    },
    {
        "role": "Pharmacist",
        "domain": "health",
        "text": "Looking for a Pharmacist to support dispensing tasks, safety checks, and stock tracking."
    },
    {
        "role": "Pharmacist",
        "domain": "health",
        "text": "Pharmacist role involving medication preparation, oversight, and accuracy monitoring."
    },
    {
        "role": "High School Teacher",
        "domain": "education",
        "text": "Seeking a High School Teacher to prepare lessons, support instruction, and evaluate student progress."
    },
    {
        "role": "High School Teacher",
        "domain": "education",
        "text": "Hiring a High School Teacher to deliver subject content, manage classroom activities, and maintain records."
    },
    {
        "role": "Highchool Teacher",
        "domain": "education",
        "text": "High School Teacher needed for instruction, assessment, and lesson planning duties."
    },
    {
        "role": "High School Teacher",
        "domain": "education",
        "text": "Looking for a High School Teacher to support curriculum delivery and student engagement."
    },
    {
        "role": "High School Teacher",
        "domain": "education",
        "text": "Join our school as a High School Teacher focusing on structured instruction and evaluation."
    },
    {
        "role": "University Lecturer",
        "domain": "education",
        "text": "Seeking a University Lecturer to teach courses, prepare materials, and supervise students."
    },
    {
        "role": "University Lecturer",
        "domain": "education",
        "text": "Hiring a University Lecturer to deliver lectures, support assessment, and guide academic work."
    },
    {
        "role": "University Lecturer",
        "domain": "education",
        "text": "University Lecturer needed to assist with instruction, student advising, and curriculum planning."
    },
    {
        "role": "University Lecturer",
        "domain": "education",
        "text": "Looking for a University Lecturer to support teaching routines, evaluation, and course coordination."
    },
    {
        "role": "University Lecturer",
        "domain": "education",
        "text": "University Lecturer role focusing on academic delivery, feedback, and documentation."
    },
    {
        "role": "Research Assistant",
        "domain": "education",
        "text": "Seeking a Research Assistant to support data collection, analysis, and reporting tasks."
    },
    {
        "role": "Research Assistant",
        "domain": "education",
        "text": "Hiring a Research Assistant to assist with experiments, documentation, and literature reviews."
    },
    {
        "role": "Research Assistant",
        "domain": "education",
        "text": "Research Assistant needed to support study execution, data entry, and procedural accuracy."
    },
    {
        "role": "Research Assistant",
        "domain": "education",
        "text": "Looking for a Research Assistant to help with research logistics, data handling, and reporting."
    },
    {
        "role": "Research Assistant",
        "domain": "education",
        "text": "Research Assistant role involving data work, preparation, and coordination."
    },
    {
        "role": "Electrician",
        "domain": "trades",
        "text": "Hiring an Electrician to assist with wiring, maintenance, and safety checks."
    },
    {
        "role": "Electrician",
        "domain": "trades",
        "text": "Seeking an Electrician to support installations, troubleshoot issues, and maintain compliance."
    },
    {
        "role": "Electrician",
        "domain": "trades",
        "text": "Electrician needed for circuit work, testing procedures, and repair assistance."
    },
    {
        "role": "Electrician",
        "domain": "trades",
        "text": "Looking for an Electrician to maintain electrical systems, review faults, and support operations."
    },
    {
        "role": "Electrician",
        "domain": "trades",
        "text": "Electrician role involving installation, testing, and routine inspection."
    },
    {
        "role": "Mechanical Technician",
        "domain": "trades",
        "text": "Seeking a Mechanical Technician to inspect equipment, perform repairs, and review technical issues."
    },
    {
        "role": "Mechanical Technician",
        "domain": "trades",
        "text": "Hiring a Mechanical Technician to support maintenance tasks and quality checks."
    },
    {
        "role": "Mechanical Technician",
        "domain": "trades",
        "text": "Mechanical Technician needed for machine work, troubleshooting, and operational support."
    },
    {
        "role": "Mechanical Technician",
        "domain": "trades",
        "text": "Looking for a Mechanical Technician to maintain systems, repair faults, and document procedures."
    },
    {
        "role": "Mechanical Technician",
        "domain": "trades",
        "text": "Mechanical Technician role involving repair tasks, inspections, and safety compliance."
    },
    {
        "role": "Construction Supervisor",
        "domain": "trades",
        "text": "Seeking a Construction Supervisor to coordinate site work, monitor safety, and support scheduling."
    },
    {
        "role": "Construction Supervisor",
        "domain": "trades",
        "text": "Hiring a Construction Supervisor to oversee daily tasks, track progress, and manage logistics."
    },
    {
        "role": "Construction Supervisor",
        "domain": "trades",
        "text": "Construction Supervisor needed to support on-site coordination and documentation."
    },
    {
        "role": "Construction Supervisor",
        "domain": "trades",
        "text": "Looking for a Construction Supervisor to assist with planning, reporting, and team oversight."
    },
    {
        "role": "Construction Supervisor",
        "domain": "trades",
        "text": "Construction Supervisor role involving quality checks, coordination, and safety review."
    },
    {
        "role": "Policy Analyst",
        "domain": "public",
        "text": "Hiring a Policy Analyst to research topics, prepare briefs, and support review processes."
    },
    {
        "role": "Policy Analyst",
        "domain": "public",
        "text": "Seeking a Policy Analyst to evaluate information, write summaries, and assist with recommendations."
    },
    {
        "role": "Policy Analyst",
        "domain": "public",
        "text": "Policy Analyst needed for analysis tasks, data review, and documentation."
    },
    {
        "role": "Policy Analyst",
        "domain": "public",
        "text": "Looking for a Policy Analyst to conduct background research and support reporting."
    },
    {
        "role": "Policy Analyst",
        "domain": "public",
        "text": "Policy Analyst role involving structured research, drafting, and review."
    },
    {
        "role": "Social Worker",
        "domain": "public",
        "text": "Seeking a Social Worker to support case documentation, outreach, and assessment tasks."
    },
    {
        "role": "Social Worker",
        "domain": "public",
        "text": "Hiring a Social Worker to assist with community work, reporting, and coordination."
    },
    {
        "role": "Social Worker",
        "domain": "public",
        "text": "Social Worker needed for intake, documentation, and monitoring routines."
    },
    {
        "role": "Social Worker",
        "domain": "public",
        "text": "Looking for a Social Worker to handle support tasks, follow-up, and communication duties."
    },
    {
        "role": "Social Worker",
        "domain": "public",
        "text": "Social Worker role involving case management support and basic reporting."
    },
    {
        "role": "Graphic Designer",
        "domain": "creative",
        "text": "Hiring a Graphic Designer to create visual content, support layouts, and review design drafts."
    },
    {
        "role": "Graphic Designer",
        "domain": "creative",
        "text": "Seeking a Graphic Designer to assist with visual assets, branding tasks, and design revisions."
    },
    {
        "role": "Graphic Designer",
        "domain": "creative",
        "text": "Graphic Designer needed to prepare graphics, organize files, and collaborate with project teams."
    },
    {
        "role": "Graphic Designer",
        "domain": "creative",
        "text": "Looking for a Graphic Designer to support visual production, formatting, and concept development."
    },
    {
        "role": "Graphic Designer",
        "domain": "creative",
        "text": "Graphic Designer role involving design preparation, refinement, and documentation."
    }
]